ES1C/src/Catalogs/md_ИндексыElasticsearch/md_ИндексыElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>md_ИндексыElasticsearch</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Ноды</name>
    <attributes>
      <name>Нода</name>
      <type>
        <types>CatalogRef.md_СервераElasticsearch</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ES1C/src/InformationRegisters/md_НастройкаВерсионированияОбъектовВElasticsearch/md_НастройкаВерсионированияОбъектовВElasticsearch.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>md_НастройкаВерсионированияОбъектовВElasticsearch</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПакетнаяОтправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособСериализации</name>
    <type>
      <types>EnumRef.md_СпособыСериализацииДокументовElasticsearch</types>
    </type>
  </resources>
  <resources>
    <name>Приостановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СерверElasticsearch</name>
    <type>
      <types>CatalogRef.md_СервераElasticsearch</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексES</name>
    <type>
      <types>CatalogRef.md_ИндексыElasticsearch</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ES1C/src/Catalogs/md_ИндексыElasticsearch/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем Нода, СсылкаНаОбъект;
	
	Параметры.Свойство("Нода", Нода);
	Параметры.Свойство("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Если ЗначениеЗаполнено(Нода) И ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	md_НастройкаВерсионированияОбъектовВElasticsearch.ИндексES КАК Индекс
		|ИЗ
		|	РегистрСведений.md_НастройкаВерсионированияОбъектовВElasticsearch КАК
		|		md_НастройкаВерсионированияОбъектовВElasticsearch
		|ГДЕ
		|	md_НастройкаВерсионированияОбъектовВElasticsearch.ТипМетаданных = &ТипМетаданных
		|	И md_НастройкаВерсионированияОбъектовВElasticsearch.СерверElasticsearch = &СерверElasticsearch";
		
		Запрос.УстановитьПараметр("ТипМетаданных", СсылкаНаОбъект.Метаданные().ПолноеИмя());
		Запрос.УстановитьПараметр("СерверElasticsearch", Нода);
		
		Индексы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Индекс");
		
		ДанныеВыбора = Новый СписокЗначений();
		ДанныеВыбора.ЗагрузитьЗначения(Индексы);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
